<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN"

 "http://www.w3.org/TR/REC-html40/loose.dtd">

<html>

<head>

      <title>Anuncios curso de R para docentes</title>
      <meta http-equiv="Content-Type"
            content="text/html;charset=iso-8859-1">
      <link rel="stylesheet" type="text/css" href="classes.css">
      <style type="text/css"></style>

</head>



<body bgcolor="#FFFFFF" background="images/fondo_blanco2.gif">
<center>
<img src="images/itam.gif" alt="Instituto Tecnol&oacute;gico Aut&oacute;nomo de M&eacute;xico"/>
<img src="images/estadistica.gif" alt="Departamento de Estad&iacute;stica"/>
<h1 class="title">R para docentes</h1>
<H2 class="title">Semestre Primavera 2023</H2>


<h6 class="nav"><a class="onsite" href="index.html">Bienvenida</a> |
    <a class="onsite" href="syllabus.html">Silabario</a> |
    <a class="onsite" href="contents.html">Contenido</a> |
    <a class="onsite" href="announce.html">Anuncios</a> |
    <a class="onsite" href="assign.html">Tareas</a> |
    <a class="onsite" href="handouts.html">Notas</a> |
    <a class="onsite" href="data.html">Datos</a> |
    <a class="onsite" href="programa.html">Calendario</a></h6>


<script LANGUAGE ="Javascript" type="text/javascript">
<!-- //hide script from old browsers
document.write("&Uacute;ltima actualizaci&oacute;n "+
document.lastModified +" ");
//end hiding contents -->
</script>



</center>



<hr>
<ul>Enero 19, 2023
<li>Pueden encontrar varias "cheatsheets" en el directorio <a class="onsite" href="Cheatsheets/"></li>
<li>El jueves estaré en la entrada de la biblioteca de 7 a 8 de la mañana para hacer aclaraciones y entregar todas las calificaciones. </li></ul>
<ul>Mie Nov 26
<li>La <a class="onsite" href="download/examen2sol.pdf">soluci&oacute;n al segundo examen parcial</a> se encuentra disponible. Los scripts asociados al archivo soluci&oacute;n se encuentran <a class="onsite" href="scripts/examen2.r">aqu&iacute;.</a></li>
<li>El art&iacute;culo del que les habl&eacute; hoy sobre c&oacute;pulas en estudios actuariales se puede encontrar en el siguiente link: <a class="offsite" href="http://www.soa.org/library/naaj/1997-09/naaj9801_1.pdf">http://www.soa.org/library/naaj/1997-09/naaj9801_1.pdf</a></li>
</ul>
<ul>Vie Nov 13
<li>La <a class="onsite" href="hwksol/soltarea4.pdf">soluci&oacute;n a la tarea 4</a> est&aacute; disponible.
<li>En la clase de ma&ntilde;ana veremos el muestreo de Gibbs. Espero que hayan le&iacute;do el art&iacute;culo que les di en clase desde la semana pasada.</li>
<li>El examen final se encuentra <a class="onsite" href="download/examenf.pdf">aqu&iacute;</a>. La fecha de entrega es el d&iacute;a del examen final, martes 9 de diciembre de las 7:00 a las 7:15 de la ma&ntilde;ana. Ese d&iacute;a les entregar&eacute; la soluci&oacute;n del examen a las 7:15 en punto y no aceptar&eacute; por ning&uacute;n motivo ex&aacute;menes despu&eacute;s de esa hora.</li>
<li>El <a class="onsite" href="download/examen2.pdf">segundo examen parcial</a> se encuentra disponible. La fecha de entrega es el d&iacute;a lunes 24 de noviembre.</li>
<li>Por &uacute;ltimo, s&oacute;lo falta una tarea normal de 3 o 4 problemas que les dar&eacute; despu&eacute;s del examen parcial.</li>
</ul>
</li></ul>
<ul>Vie Nov 7
<li>La <a class="onsite" href="download/examen1_sol.pdf">soluci&oacute;n al primer examen parcial</a>  ya esta disponible. </li>
<li>En la secci&oacute;n de datos se encuentran los precios de los instrumentos que vimos en clase.</li>
<li>Ya est&aacute;n disponibles los scripts asociados con la simulaci&oacute;n hist&oacute;rica y la simulaci&oacute;n Monte Carlo del VaR, en la secci&oacute;n de notas.</li>
</ul>
<ul>Mie Oct 29
<li>La clase del lunes ser&aacute; repuesta uno de los s&aacute;bados de noviembre en los que tenemos clase (en lugar de dos horas ser&aacute;n tres). Nos pondremos de acuerdo en alguna de nuestras clases.</li>
<li>La tarea 4 est&aacute; disponible.</li>
<li>Durante este fin de semana tratar&eacute; de evaluar todas las tareas que tengo pendientes con ustedes y de proveer al menos soluciones para el examen parcial.</li></ul>
<ul>Jue Oct 23
<li>La fecha anunciada para el examen final de la clase de Simulaci&oacute;n es el <em>martes 9 de diciembre de 7:00 a 10:00 de la ma&ntilde;ana</em>. Tomen nota.</li></ul>
<ul>Mie Sep 10
<li>El <a class="onsite" href="hwk/examen1.pdf">primer examen parcial</a> tiene fecha de entrega el mi&eacute;rcoles 22 de octubre de 2003 al inicio de la clase. Para dudas sobre el examen por favor escriban a mi cuenta de hotmail <a href="mailto:jfdlvg@hotmail.com">jfdlvg@hotmail.com</a> S&oacute;lo usen esta cuenta mientras no estoy en M&eacute;xico. En lo subsecuente escr&iacute;banme a mi cuenta del Banco. </li>
<li>A continuaci&oacute;n propongo una serie de lecturas durante mi ausencia.
<ul> Semana 1:
    <li><a class="offsite" href="http://www.informs-cs.org/wsc02papers/002.pdf">Introduction to simulation</a>, de Ricki G. Ingalls. </li>
    <li><a class="offsite" href="http://www.informs-cs.org/wsc02papers/003.pdf">Spreadsheet Simulation</a>, de Andrew F. Seila. Ideas y observaciones sobre simulaci&oacute;n en hojas de c&aacute;lculo. </li></ul>
<ul> Semana 2: 
    <li><a class="offsite" href="http://www.informs-cs.org/wsc99papers/001.PDF">Introduction to simulation</a>, de Jerry Banks. </li>
    <li><a class="offsite" href="http://www.informs-cs.org/wsc00papers/005.PDF">Tips for Successful Practice of Simulation</a>, de Deborah A. Sadowski y Mark R. Grabau.</li>
</ul>
<ul> Semana 3: 
    <li><a class="offsite" href="http://www.informs-cs.org/wsc01papers/006.PDF">Some myths and common errors in Simulation Experiments</a>, de Bruce W. Schmeiser. </li>
    <li><a class="offsite" href="http://www.informs-cs.org/wsc01papers/007.PDF">Designing Simulation Experiments</a>, de Rusell R. Barton </li>
</ul>
<ul> Semana 4:
    <li><a class="offsite" href="http://www.informs-cs.org/wsc00papers/004.PDF">Input Modelling</a>, de Lawrence Leemis</li>
    <li><a class="offsite" href="http://www.informs-cs.org/wsc98papers/001.PDF">Introduction to the Art and Science of Simulation</a>, de Robert E. Shannon</li>

</ul>
<ul> Semana 5:
     <li><a class="offsite" href="http://www.informs-cs.org/wsc00papers/009.PDF">Verification, Validation, and Accreditation of Simulation Models</a>, de Robert G. Sargent </li>
</ul></li>
</ul>
<ul>Lun Sep 8
<li><a class="offsite" href="http://www.informs-cs.org/wscpapers.html">Winter Simulation Conferences.</a> En los Proceedings de las conferencias, se puede encontrar informaci&oacute;n relevante e importante sobre teor&iacute;a y aplicaciones en la simulaci&oacute;n.</li></ul>
<ul>Sab Sep 6
<li>En la secci&oacute;n de <a class="onsite" href="programa.html">Calendario</a> tengo una propuesta de los temas que se cubrir&aacute;n en las clases de ahora en adelante. Tratar&eacute; de apegarme lo mejor posible a los tiempos, pero en caso de que se requiera extenderse en alg&uacute;n tema prefiero cubrir bien pocos temas en lugar de muchos temas no comprendidos.</li>
<li> Tambi&eacute;n estoy actualizando algunas referencias para los t&oacute;picos a cubrir. Voy a proveerlos de los art&iacute;culos que considero son ilustrativos y pedag&oacute;gicos.</li>
</ul>
<ul>Mie Sep 3
<li>A partir de hoy, todos los scripts se podr&aacute;n encontrar en la p&aacute;gina de notas, para no duplicar ligas.</li>
<li>Se les recuerda que por consenso, habr&aacute; clase el s&aacute;bado 6 de septiembre, de 8 a 10 de la ma&ntilde;ana.</li>
</ul>
<ul>Lun Sep 1
<li>La liga al programa de la Cauchy que envuelve a la Gamma est&aacute; corregido (en la secci&oacute;n de notas). Pueden bajar el programa y verlo como ejemplo.</li>
<li>Referencias adicionales que me han pedido para conocer m&aacute;s de R son las siguientes:
<ul>
<li>Venables, W.N. y B.D. Ripley. <em>Modern Applied Statistics with S-plus.</em> Third ed., Springer, 2001. Este libro provee un panorama general de metodolog&iacute;a estad&iacute;stica a trav&eacute;s de ejemplos en S-plus, que son casi 100% extrapolables a R.</li>
<li>Becker, Richard A., John M Chambers y Allan R. Wilks. <em>The new S Language. A programming environment for data analysis and graphics.</em> Wadsworth & Brooks/Cole. California, 1988.</li>
<li>Spector, Phil. <em>An introduction to S and S-Plus</em> Duxbury Press, California, 1994</li></ul>
</li>
<li>La tarea 3 est&aacute; lista en la secci&oacute;n de tareas. Esta tarea es previa a la tarea que contar&aacute; como examen parcial. La fecha de entrega es el 12 de Septiembre. Ya no voy a seguir aceptando tareas parciales ni extensiones a la fecha de entrega, por favor.</li>
</ul>
<ul>Lun Ago 25
<li>El s&aacute;bado 30 de agosto es la clase de reposici&oacute;n de 8:00 a 9:30 am en el sal&oacute;n 212.</li>
<li>Las siguientes <a class="onsite" href="download\sim.pdf">notas </a> cubren algunos de los t&oacute;picos que veremos en esta clase, aunque pueden ser un poco densas. Puede ser de inter&eacute;s como notas complementarias. Les sugiero que lean el cap&iacute;tulo 1.</li>
</ul>
<ul>Mie Ago 20
<li>La segunda tarea est&aacute; disponible Tambi&eacute;n encontrar&aacute;n en la secci&oacute;n de notas
un resumen del Cap&iacute;tulo 7 que un compa&ntilde;ero de ustedes encontr&oacute; en internet y que 
gentilmente me dio a conocer.</li>
<li>El siguiente <a class="onsite" href="scripts\middle_square.r">script</a> define una funci&oacute;n en R que calcula la sucesi&oacute;n de n&uacute;meros del algoritmo del cuadrado medio de Von Neumann. El archivo tiene extension "*.r", pero es un archivo en ASCII.</li>
</ul>
<ul>Lun Ago 18
<li>No hubo clase. La clase ser&aacute; repuesta m&aacute;s adelante.</li>
</ul>
<ul>Mie Ago 13
<li>La primera tarea est&aacute; disponible en la p&aacute;gina Web</li>
<li>Respecto a las cosas que quedaron pendientes en la clase de hoy, por 
    favor revisen la siguiente <a class="onsite" href="download\notaclase2.pdf">nota</a></li>
</ul>
<hr>

<center>

<h6 class="nav"><a class="onsite" href="index.html">Bienvenida</a> |
    <a class="onsite" href="syllabus.html">Silabario</a> |
    <a class="onsite" href="contents.html">Contenido</a> |
    <a class="onsite" href="announce.html">Anuncios</a> |
    <a class="onsite" href="assign.html">Tareas</a> |
    <a class="onsite" href="handouts.html">Notas</a> |
    <a class="onsite" href="data.html">Datos</a> |
    <a class="onsite" href="programa.html">Calendario</a></h6>
</center>



<hr>



<center>

<ADDRESS>&copy;2003 Jorge de la Vega, ITAM</ADDRESS>


<SCRIPT LANGUAGE ="Javascript" type="text/javascript">
<!-- //hide script from old browsers
document.write("&Uacute;ltima actualizaci&oacute;n "+
document.lastModified +" ");
//end hiding contents -->
</SCRIPT>

<p>
    <a href="http://validator.w3.org/check/referer"><img border=0
        src="images/vh40.png"
        alt="Valid HTML 4.0!" height=31 width=88></a>
    <A HREF="http://jigsaw.w3.org/css-validator/check/referer">
    <IMG style="border:0;width:88px;height:31px"
       SRC="images/vcss.gif"
       ALT="Valid CSS!"></A>
  </p>

</CENTER>
</body>
</html>
